[VCP_MedicalSniper X2EncyclopediaTemplate]
ListTitle = "医影狙锋"
DescriptionTitle = "医影狙锋"
DescriptionEntry = "一位精准与关怀的大师，医影狙锋从远处提供关键支援，以精准的治愈射击支援盟友，同时以高超的射击技巧使敌人保持距离."
[VCP_MedicalSniper X2SoldierClassTemplate]
DisplayName="医影狙锋"
ClassSummary="一位精准与关怀的大师，医影狙锋从远处提供关键支援，以精准的治愈射击支援盟友，同时以高超的射击技巧使敌人保持距离."

;***************************************
; - GTS UNLOCKS -
;***************************************

;MedicalSniper Unlocks
[VCP_MedicalSniperUnlocks1 X2SoldierAbilityUnlockTemplate]
DisplayName = "医影狙锋: 医术高超 2"
Summary = "所有医影狙锋，不论军衔，都将获得医术高超2."
[VCP_MedicalSniperUnlocks2 X2SoldierAbilityUnlockTemplate]
DisplayName = "医影狙锋: 医术高超 3"
Summary = "所有医影狙锋，不论军衔，都将获得医术高超3."
[VCP_MedicalSniperUnlocks3 X2SoldierAbilityUnlockTemplate]
DisplayName = "医影狙锋: 医术高超 4"
Summary = "所有医影狙锋，不论军衔，都将获得医术高超4."

;***************************************
;New Ability Descriptions
;***************************************

;MedicalSniper Ability
[VCP_MedicalSniperMastery X2AbilityTemplate]
LocFriendlyName = "医术高超"
LocHelpText = " <Ability:ClassName/> 随着经验的积累提升其能力."
LocLongDescription = " <Ability:ClassName/> 随着经验的积累提升其能力."
LocPromotionPopupText = "<font color='#CA7200'>等级1</font> 获得<Ability:RANKNAME1/> rank [1]<br/><Bullet/>获得<font color='#3ABD23'>远见</font> - 赋予远程警戒和小队视野.<br/><Bullet/>提供一个用于医疗物品的辅助槽位.<br/><br/><font color='#CA7200'>等级2</font> 获得<Ability:RANKNAME3/> rank [3]<br/><Bullet/>获得<font color='#3ABD23'>超频小精灵</font> -  为护盾协议提供额外使用次数，并且当你对盟友使用援助协议时，也允许你对自己使用援助协议.<br/><br/><font color='#CA7200'>等级3</font> 获得<Ability:RANKNAME5/> rank [5]<br/><Bullet/>获得<font color='#3ABD23'>隐秘急救</font> -当受到攻击时，尝试重新隐蔽.<br/><Bullet/>获得一个免费的医疗包使用次数，并且每装备一个医疗包就额外获得一次使用次数.<br/><br/><font color='#CA7200'>等级4</font> 获得<Ability:RANKNAME7/> rank [7]<br/><Bullet/>获得<font color='#3ABD23'>过度保护的伙伴</font> - 羁绊队友在每次任务开始时获得额外生命值、吸收伤害生命值和防御力加成，这些加成持续整个任务."
